load-test.yml

config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - name: "Get timestamp"
    flow:
      # Get ten timestamps
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"
      - get:
          url: "/timestamp"